[
    {
        "name": "Паста с шампиньонами и курицей в сливочном соусе",
        "img": "https://www.maggi.ru/data/images/recept/img640x500/recept_5965_ii06.jpg",
        "description": "Режем куриное филе небольшими кубиками, обжариваем до румяной корочки, и отставляем в сторону. На сковороду, где обжаривалось мясо, добавляем ещё чуть оливкового масла, небольшой кусочек сливочного. Пока оно тает режем лук, мелко-мелко чеснок, и обжариваем до прозрачного цвета лука.(5 минут на небольшом огне). За 5 минут что у нас обжаривается лук с чесноком мы нарезаем грибы и добавляем их в сковороду и обжариваем около 10-ти минут, пока из них не испарится вода. Варим пасту! Ставим чайник, наливаем в кастрюлю подсолнечного масла, солим, заливаем кипятком, кидаем туда пасту и варим на 2-3 минуты больше чем указано на упаковке=))) Потом сливаем воду и добавляем кусочек сливочного масла, накрываем крышкой и отчаянно трусим кастрюльку, пока масло не растопится=) К этому времени грибы у нас готовы, посему мы уменьшаем огонь до самого маленького, и заливаем грибы сливками, добавляем туда кусочки курицы и оставляем прогреваться 4-5 минут. И именно сейчас мы солим и перчим по вкусу, что бы сливки не свернулись. Крышкой накрывать ничего нельзя!",
        "ingredients": [
            {
                "id": 11,
                "mass": 500
            },
            {
                "id": 3,
                "mass": 100
            },
            {
                "id": 13,
                "mass": 30
            },
            {
                "id": 8,
                "mass": 300
            },
            {
                "id": 12,
                "mass": 400
            },
            {
                "id": 14,
                "mass": 100
            }
        ]
    }, {
        "name": "Баклажаны с сыром",
        "img": "https://eda.ru/img/eda/c620x415/s1.eda.ru/StaticContent/Photos/120131090259/120213174938/p_O.jpg",
        "description": "Помидоры нарезать кубиками, поджарить на масле с добавлением измельченного чеснока. В горячие помидоры добавить тертый сыр.Баклажаны разрезать вдоль, обвалять в муке с солью, сверху положить смесь помидоров с чесноком и сыром. Запечь в духовке до готовности.",
        "ingredients": [
            {
                "id": 1,
                "mass": 1000
            },
            {
                "id": 5,
                "mass": 450
            },
            {
                "id": 15,
                "mass": 100
            },
            {
                "id": 16,
                "mass": 30 
            },
            {
                "id": 13,
                "mass": 20 
            }
        ]
    }, {
        "name": "Суп-пюре из баклажанов",
        "img": "https://eda.ru/img/eda/c620x415/s1.eda.ru/StaticContent/Photos/120130134327/130725152751/p_O.jpg",
        "description": "Очистить баклажаны от кожицы и нарезать полукруглыми ломтиками толщиной примерно в 1 см. Зубчик чеснока очистить и измельчить, лук очистить и нарезать тонкими полукольцами. С веточек тимьяна оборвать листья.<br>В небольшой сковороде на среднем огне разогреть оливковое масло. Бросить ломтики баклажана, тимьян и влить бальзамический уксус. Перемешать и добавить еще оливкового масла. Обжарить ломтики баклажана со всех сторон.<br>В небольшой кастрюле разогреть немного оливкового масла и обжарить на небольшом огне нарубленные лук и чеснок до мягкости (в течение семи-десяти минут). Добавить жареные баклажаны, влить воду и довести до кипения. Варить двадцать минут, накрыв крышкой.<br>Снять кастрюлю с огня и с помощью погружного блендера превратить ее содержимое в пюре. А затем, при желании, дополнительно протереть через сито — для более воздушной консистенции. Добавить еще воды или бульона, если необходимо, посолить и поперчить по вкусу.<br>Готовый суп можно снова слегка подогреть на огне, а можно сразу разлить по тарелкам — он хорош и в горячем, и в теплом состоянии. Украсить каждую порцию листочками тимьяна и подавать.",
        "ingredients": [
            {
                "id": 1,
                "mass": 600
            },
            {
                "id": 13,
                "mass": 40
            },
            {
                "id": 3,
                "mass": 100
            }
        ]
    }, {
        "name": "Жаренная картошка с луком",
        "img": "https://calorizator.ru/sites/default/files/imagecache/recipes_full/recipe/56373.jpg",
        "description": "Чистим картошку, закидываем в подсоленную воду, доводим до кипения, варим так 6 минут(вся картошка должна быть однго размера, примерно, как большой мандарин). Пока варится картошка нарезаем мелко лук и жарим его до золотистого цвета, снимаем с огня и отставляем на время. Немного отваренную картошку нарезаем, как угодно. На сковородку добавляем достаточно большой кусок сливочного масла и столько же растительного. Когда масло немного закипит высыпаем картошку. Главное при жарке это перемешивать картошку каждые две минуты, не чаще. Так перемешать надо в сумме 10 раз, на последние два раза добавляем к картошке лук и любые специи. Затем выключаем огонь и можно дать минут 5 картошке отдохнуть под крышкой. Приятного аппетита!",
        "ingredients": [
            {
                "id": 2,
                "mass": 500
            },
            {
                "id": 3,
                "mass": 100
            }
        ]
    }, {
        "name": "Варёный картофель",
        "img": "https://static.1000.menu/img/content-v2/f9/76/10414/kartofel-otvarnoi_1584790945_11_max.jpg",
        "description": "Почистить картофель, если хотите, нарезать, налить воду в кастрюлю, посолить по вкусу, добавить в воду картофель, поставить на огонь, варить до готовности. Слить воду и добавить зелень.",
        "ingredients": [
            {
                "id": 2,
                "mass": 50
            }
        ]
    }, {
        "name": "Ароматная морковь в специях по-африкански",
        "img": "https://eda.ru/img/eda/c620x415/s1.eda.ru/StaticContent/Photos/120131082425/120214140923/p_O.jpg",
        "description": "Очистите морковь и порежьте небольшими кружками, чтобы получилось примерно 3 стакана. Разогрейте оливковое масло в сковороде на среднем огне. Добавьте измельченный чеснок, кумин и кориандр. Готовьте 20 секунд, помешивая, до появления запаха. Добавьте морковь, воду, лимонный сок и соль. Доведите до кипения, сделайте маленький огонь, накройте крышкой и тушите 6–8 минут до мягкости. Откройте крышку и готовьте еще 2–4 минуты, пока морковь не станет совсем мягкая и жидкость не превратится в сироп. Вмешайте петрушку и подавайте горячей или комнатной температуры.",
        "ingredients": [
            {
                "id": 0,
                "mass": 300
            }, {
                "id": 13,
                "mass": 80
            }
        ]
    }, {
        "name": "Сладкий перец",
        "img": "https://pics.botanichka.ru/wp-content/uploads/2019/02/12-samyih-vkusnyih-sortov-13.jpg",
        "description": "Помыть перец, отрезать хвостик, поставиь на доску хвостиком вниз, резать от верха вних, обходя серцивину. Выкинуть семечки, нарезать перец как угодно.",
        "ingredients": [
            {
                "id": 4,
                "mass": 100
            }
        ]
    }, {
        "name": "Томат",
        "img": "https://leplants.ru/static/cache/d3/3d/d33d8208fa1d5514e428eb812d090c35.jpg",
        "description": "Помыть, нарезать",
        "ingredients": [
            {
                "id": 5,
                "mass": 50
            }
        ]
    }, {
        "name": "Блины",
        "img": "https://prostokvashino.ru/upload/iblock/d62/d6269fa359b8595e632183c2c267c4ec.jpg",
        "description": " В глубокую миску засыпаем просеянную муку, вбиваем в нее два яйца, добавляем соль и сахар. Начинаем активно перемешивать ингредиенты, пытаясь добиться однородной массы. Продолжаем мешать наш раствор для блинчиков. Задача на этом этапе – разбить все комочки. Если не сделать это сейчас, то дальше ситуация только усугубится, и блины уже не получатся тонкими и аккуратными. Как видно, раствор пока получается густым, больше похожим на тесто. Поэтому самое время влить в него молоко. Лучше делать это постепенно, постоянно помешивая. Так мы избежим появления комочков.  Продолжаем процесс до тех пор, пока тесто не станет жидковатым. Но не пытайтесь добиться слишком жидкой консистенции. Из такого раствора удачные блины не получатся. Приступаем к выпеканию. Предварительно разогреваем сковороду и смазываем с помощью кисточки растительным маслом. Набираем половником раствор и аккуратно заливаем на сковороду, равномерно раскатывая по всей ее поверхности. Самая сложная задача – перевернуть блин. Бабушки делают это голыми руками, но рисковать не стоит – лучше помочь себе лопаточкой. Индикатор полуготовности блина – подрумянившийся «бочок» и края, легко отходящие от сковородки. По мере готовности блинов складываем их в ровную стопочку. Многие хозяйки смазывают блины сливочным маслом, но это дело вкуса. Кушайте горячие блинчики и угощайте ими гостей. Приятного аппетита!",
        "ingredients": [
            {
                "id": 7,
                "mass": 100
            }, {
                "id": 16,
                "mass": 200
            }, {
                "id": 6,
                "mass": 500
            }
        ]
    }, {
        "name": "Яичница",
        "img": "https://i.ytimg.com/vi/rCG4CDE0dTM/maxresdefault.jpg",
        "description": "Добавить масло на разогретую сковороду. Разбить яйца на разогретое масло, добавить специи по вкусу. Жарить до готовности на среднем огне.",
        "ingredients": [
            {
                "id": 7,
                "mass": 50
            }             
        ]
    }, {
        "name": "Яичница болтунья",
        "img": "https://kopilka-kulinara.ru/upload/information_system_56/2/8/1/item_2818/item_2818.jpg",
        "description": "Добавить масло на разогретую сковороду. Разбить яйца на разогретое масло, постоянно перемешивать яйца на сковороде, добавить специи по вкусу. Жарить до готовности на маленьком огне.",
        "ingredients": [
            {
                "id": 7,
                "mass": 50
            }             
        ]
    }, {
        "name": "Стейк из говядины",
        "img": "https://www.maggi.ru/data/images/recept/img640x500/recept_13019_irj6.jpg",
        "description": "Когда сковорода с маслом уже стоит на разогреве, стейк солится-перчится как минимум с одной стороны. На эту сторону он и укладывается в начале жарки. Вторую можно посолить-поперчить потом, в ходе обжаривания. А можно и перед, никакой разницы нет, учёные проверяли. Короче, миф о том, что вторая сторона приправлятся только тогда, когда стейк уже лежит на сковороде, развеян путём химического анализа. Главное, — не пытаться мариновать стейк заранее, в этом случае он будет терять сок. Жарить сначала 1-2 минуты с каждой стороны на сильном огне, затем довести на среднем, после положить в фольку на пару минут.",
        "ingredients": [
            {
                "id": 9,
                "mass": 200
            }             
        ]
    }, {
        "name": "Стейк из свинины",
        "img": "https://infoeda.com/wp-content/uploads/2017/09/Steik_iz_svininy_na_skovorode.jpg",
        "description": "Когда сковорода с маслом уже стоит на разогреве, стейк солится-перчится как минимум с одной стороны. На эту сторону он и укладывается в начале жарки. Вторую можно посолить-поперчить потом, в ходе обжаривания. А можно и перед, никакой разницы нет, учёные проверяли. Короче, миф о том, что вторая сторона приправлятся только тогда, когда стейк уже лежит на сковороде, развеян путём химического анализа. Главное, — не пытаться мариновать стейк заранее, в этом случае он будет терять сок. Жарить сначала 1-2 минуты с каждой стороны на сильном огне, затем довести на среднем, после положить в фольку на пару минут.",
        "ingredients": [
            {
                "id": 10,
                "mass": 200
            }             
        ]
    }
]